
#include "common.h"
#include "dma.h"
#include "tim.h"

/*****************************************************************************/
/* флаг завершения указанного числа преобразований и передач */
volatile uint8_t dma_end_transf;

/*****************************************************************************/

uint32_t dma_init(void){
	/* разрешение тактирования DMA1 */
    RCC->AHBENR |= RCC_AHBENR_DMA1EN;
    /* настройка первого канала
           размер передачи 16 бит,
           разрешение прерываний по завершению,
           максимальный приоритет канала,
           инкремент адреса в памяти */
    DMA1_Channel1->CCR |= DMA_CCR1_TCIE |
                          DMA_CCR1_PSIZE_0 |
                          DMA_CCR1_MSIZE_0 |
                          DMA_CCR1_PL |
                          DMA_CCR1_MINC;
    DMA1_Channel1->CCR &= ~DMA_CCR1_DIR;
    DMA1_Channel1->CCR &= ~DMA_CCR1_PINC;
    /* разрешение прерывания от канала по завершению передачи */
    NVIC_EnableIRQ(DMA1_Channel1_IRQn);
    /* инициализация флага завершения преобразований и передач */
    dma_end_transf = 0;

    return (DMA_INIT_OK);
}

/*****************************************************************************/

void DMA1_Channel1_IRQHandler(void) {
	/* взводиться флаг завершения передачи */
    dma_end_transf = 1;
    /* остановка таймера триггера измерений */
    tim3_stop();
    /* проверка завершения передачи */
    if(DMA1->ISR & DMA_ISR_TCIF1){
    	/* сброс флага завершения */
        DMA1->IFCR  |= DMA_IFCR_CTCIF1;
    }
    /* остановка канала */
    DMA1_Channel1->CCR  &= ~DMA_CCR1_EN;
}

/*****************************************************************************/

void dma_ch_prep(uint32_t dma_cnt_b){

	/*uint32_t i=0;
	for(i=0; i<dma_cnt_b; i++) {
		adc_data_ar[i] = (uint16_t) 0x0000;
	}*/

	/* адрес назначения в памяти */
    DMA1_Channel1->CMAR  = (uint32_t) &adc_data_ar;
    /* адрес источника периферии */
    DMA1_Channel1->CPAR  = (uint32_t) &(ADC1->DR);
    /* установка количества передаваемых данных */
    DMA1_Channel1->CNDTR = dma_cnt_b;
    /* разрешение работы канала */
    DMA1_Channel1->CCR  |= DMA_CCR1_EN;

}

/*****************************************************************************/
